#include "common.h"
#include "../../board.h"
#include "../../heap_permanent.h"
#include "../../heap_temporary.h"
#include "../../player.h"
#include "../../process.h"
#include "../../spaces.h"

struct hvq_table_initial {
    u32 count;
    u32 offsets[3];
};

struct hvq_metadata {
    /* 0x00 */ s32 tileWidth;
    /* 0x04 */ s32 tileHeight;
    /* 0x08 */ s32 tileCountX;
    /* 0x0C */ s32 tileCountY;
    /* 0x10 */ f32 fov;
    /* 0x14 */ f32 scaleFactor;
    /* 0x18 */ f32 cameraEyePosX;
    /* 0x1C */ f32 cameraEyePosZ;
    /* 0x20 */ f32 cameraEyePosY;
    /* 0x24 */ f32 lookatPointX;
    /* 0x28 */ f32 lookatPointZ;
    /* 0x2C */ f32 lookatPointY;
    /* 0x30 */ f32 cameraUpVecX;
    /* 0x34 */ f32 cameraUpVecZ;
    /* 0x38 */ f32 cameraUpVecY;
}; // sizeof 0x3C / 60

extern s8 D_800CD069;
extern s16 D_800D41C2;

extern s32 D_80100F90;

extern s32 D_801011FC;

extern u32 *D_80101240; // pointer to hvq dir offsets (table)
extern u32 *D_80101244; // pointer to hvq file offsets (table)
extern struct hvq_metadata *D_80101248; // pointer to current hvq metadata
extern s8 D_8010124C;
extern f32 D_80101250;
extern f32 D_80101254;
extern f32 D_80101258;

extern s32 D_801012BC;
extern void *D_801012C0;
extern u8 *D_801012C4;
extern u32 D_801012C8[];
extern u32 D_80101318[];
extern s32 D_80102180;
extern s16 D_80102C50;
extern void *D_80102C58[]; // function pointers given by board.
extern void (*D_80102C7C)();

extern u8 D_80102D36;
extern void *D_80102DB0; // hvq rom offset copied here
extern s32 D_80102DB4; // hvq directory count
extern s32 D_80102DB8; // hvq current file table ROM offset
extern s16 D_80102DC0;
extern s16 D_80102DC2;
extern s16 D_80102DC4;
extern s16 D_80102DC6; // total width
